#pragma once
#include "BBoundingBox.h"
#include "BBox.h"

class BBullet
{
public:
	BBoundingBox	m_BoundingBox;			// 총알 충돌바운딩박스
	float			m_fBulletSpeed;			// 총알 속도
	float			m_fBulletIntersection;  // 총알 사거리
	float			m_fOffensePower;		// 총알 공격력
	bool			m_bTrigger;				// 총알 트리거
	TVector3		m_vBulletFirstPos;		// 총알 z방향 초기 위치
	TVector3		m_vBulletPos;			// 총알 위치
	TVector3		m_vBulletDir;			// 총알 방향
	bool			m_bMapCheck;			// 총알 맵 체크
public:
	//--------------------------------------------------------------------------------------
	// 총알 요소 셋팅 함수
	//--------------------------------------------------------------------------------------
	void			SetBullet(float fBulletIntersection,
							  float fOffensePower, float fBulletSpeed);
	//--------------------------------------------------------------------------------------
	// 총알 위치 셋팅 함수
	//--------------------------------------------------------------------------------------
	void			SetBulletPos(TVector3 vPos);
	//--------------------------------------------------------------------------------------
	// 총알 방향 셋팅 함수
	//--------------------------------------------------------------------------------------
	void			SetBulletDir(TVector3 vDir);
	//--------------------------------------------------------------------------------------
	// 총알 실시간 업데이트 함수
	//--------------------------------------------------------------------------------------
	void			UpdateBullet();
	//--------------------------------------------------------------------------------------
	// 총알 사거리 체크
	//--------------------------------------------------------------------------------------
	bool			CheckBulletIntersection();
public:
	BBullet();
	virtual ~BBullet();
};

